Revit 2027 API
BuiltInFailures.RegenFailures.CircularDependency Property
 There is a circular chain of references among the highlighted elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircularDependency { get; }
Public Shared ReadOnly Property CircularDependency As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircularDependency {
	FailureDefinitionId^ get ();
}
static member CircularDependency : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace